:PROPERTIES:
:ID:       22E2131D-5ADF-46AD-BEBB-8A5745CBA94F
:END:
#+title: meta

A notebook for this project itself.

* Setup

This requires some local initialization so that it can act relatively
self-contained.

** Emacs Setup

*** ~.dir-locals.el~

To prepare for working with this repository, the ~.dir-locals.el~
file must be tangled to configure the [[info:emacs#Directory Variables][directory variables]] that can be used
for a local [[id:BD998169-D426-4D3C-A775-D2D9ED6DCFA3][org-roam]] cabinet.

~.dir-locals.el~ makes use of static values, so this leverages some noweb expansion
to populate the appropriate directory at the time of tangling.

#+name: pwd
#+begin_src emacs-lisp
  default-directory
#+end_src

#+RESULTS: pwd
: /Users/mwhipple/memex/notebooks/

#+begin_src emacs-lisp :noweb yes :tangle .dir-locals.el
  ((nil . ((org-roam-directory  . "<<pwd()>>")
           (org-roam-db-location . "<<pwd()>>org-roam.db"))))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  org-roam-directory
#+end_src

#+RESULTS:
: /Users/mwhipple/memex

#+begin_src emacs-lisp
  org-roam-db-location
#+end_src

#+RESULTS:
: /Users/mwhipple/memex/notebooks/org-roam.db

* One-Time

This captures some of the setup that was needed once, but isn't expected to be needed again.

** [[file:github.org][GitHub]] Setup

Obey GH instructions.

#+begin_src shell
echo "#+TITLE: notebooks" >> README.org
git init
git add README.org
git commit -m "first commit"
git branch -M main
git remote add origin git@github.com:mwhipple/notebooks.git
git push -u origin main
#+end_src

#+RESULTS:
| Reinitialized | existing | Git      | repository | in           | /Users/mwhipple/ws/notebooks/.git/ |                |
| [main         | b27dc91] | first    | commit     |              |                                    |                |
| 1             | file     | changed, | 1          | insertion(+) |                                    |                |
| branch        | 'main'   | set      | up         | to           | track                              | 'origin/main'. |


